Revit 2024 API
FabricationPartSizeMap.WidthDiameter Property
 The width or diameter of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public double WidthDiameter { get; set; }
Visual Basic
Public Property WidthDiameter As Double
	Get
	Set
Visual C++
public:
property double WidthDiameter {
	double get ();
	void set (double value);
}
See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace